[MZNightblade X2SoldierClassTemplate]
DisplayName = "<font color='#ff0000'>暮夜君王</font>"
ClassSummary = "“暗影之王”——德克雷亚血族，德拉科拉·德克雷亚的血承者。活用血承的能力，能够任意穿梭在深渊阴影之中，以鲜血为媒介进行攻击并施加古老的血咒，亦或献祭鲜血获得短暂的爆发一击击溃敌人，操纵来自深渊的恶灵杀伤进犯者。"
AbilityTreeTitles[0]="暗影血承"
AbilityTreeTitles[1]="渊影血枪"
AbilityTreeTitles[2]="锋影血刃"
AbilityTreeTitles[3]="XCom"
AbilityTreeTitles[4]="手枪"

RandomNickNames[0]="卡玛利拉"
RandomNickNames[1]="布鲁赫"
RandomNickNames[2]="冈格罗"
RandomNickNames[3]="迈卡维安"
RandomNickNames[4]="诺费勒"
RandomNickNames[5]="托瑞多"
RandomNickNames[6]="瑞默尔"
RandomNickNames[7]="撒巴特"
RandomNickNames[8]="勒森魃"
RandomNickNames[9]="茨密西"
RandomNickNames[10]="阿萨迈"
RandomNickNames[11]="乔凡尼"
RandomNickNames[12]="雷伏诺"
RandomNickNames[13]="瑟泰特"
RandomNickNames[14]="卡帕多西亚"
RandomNickNames[15]="玛士撒拉"

RandomNickNames_Male[0]="暗影君帅"
RandomNickNames_Male[1]="午夜领主"
RandomNickNames_Male[2]="冥渊神孽"
RandomNickNames_Male[3]="黑暗亲王"

RandomNickNames_Female[0]="月下初拥"
RandomNickNames_Female[1]="月下誓约"
RandomNickNames_Female[2]="红月夜明"
RandomNickNames_Female[3]="该隐蔷薇"

+PhotoboothSoloBLines_Male[0]="阴影？我就是黑暗本身，而黑暗，是没有阴影的。"
+PhotoboothSoloBLines_Female[0]="残忍与优雅共存...颓废与高贵同在..."

[MZNightblade_GTSUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="暮夜君王: 长生久视"
Summary="使<font color='#ff0000'>暮夜君王</font>提高<font color='#0bff9b'>2</font>点最大生命值，并额外提高<font color='#0bff9b'>34%</font>治愈速率。"

[MZBloodiedShroud X2AbilityTemplate]
+LocFriendlyName="长生久视"
+LocLongDescription="使<Ability:ClassName/>提高<font color='#0bff9b'>2</font>点最大生命值，并额外提高<font color='#0bff9b'>34%</font>治愈速率。"
+LocHelpText="使<Ability:ClassName/>提高<font color='#0bff9b'>2</font>点最大生命值，并额外提高<font color='#0bff9b'>34%</font>治愈速率。"
+LocFlyOverText="长生久视"
+LocPromotionPopupText="<Bullet/>使<Ability:ClassName/>提高<font color='#0bff9b'>2</font>点最大生命值，并额外提高<font color='#0bff9b'>34%</font>治愈速率。"

[MZObtenebration X2AbilityTemplate]
+LocFriendlyName="暗夜猎影"
+LocLongDescription="<Ability:ClassName/>掌控渊影之力，处于<font color='#0bff9b'>隐蔽</font>状态时，自身视野减少<font color='#ff3206'>30%</font>，敌军对其侦查范围减少<font color='#ff3206'>30%</font>。<br/>当小队成员暴露时，<Ability:ClassName/>将仍处于<font color='#0bff9b'>隐蔽</font>状态。更难被检测到，但视线范围减小。"
+LocHelpText="控制深渊的阴影力量。当队伍隐蔽被打破时保持隐蔽状态。更难被检测到，但视线范围减小。"
+LocFlyOverText="暗夜猎影"
+LocPromotionPopupText="<Bullet/>即使小队未以<font color='#0bff9b'>隐蔽</font>状态开始任务，激活了暗夜猎影技能的<Ability:ClassName/>也会以<font color='#0bff9b'>隐蔽</font>状态开始任务。<br/><Bullet/>如果<Ability:ClassName/>使小队的隐蔽状态<font color='#ff3206'>暴露</font>，则技能失效。<br/>"

[MZBloodGrapple X2AbilityTemplate]
+LocFriendlyName="凝血成丝"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值发射爪钩并且迅速占领高地，不消耗行动力。<br/>冷却时间：<font color='#0bff9b'>1</font>回合"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值发射爪钩并且迅速占领高地，不消耗行动力。<br/>冷却时间：<font color='#0bff9b'>1</font>回合"
+LocFlyOverText="凝血成丝"
+LocPromotionPopupText="<Bullet/>爪钩可让<Ability:ClassName/>不消耗行动点数迅速占领有利位置。<br/><Bullet/>冷却时间：<font color='#0bff9b'>1</font>回合"

[MZFalseLife X2AbilityTemplate]
+LocFriendlyName="苌弘化碧"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值生成一个临时<font color='#E69831'>护盾</font>，该<font color='#E69831'>护盾</font>可承受<font color='#0bff9b'><Ability:FalseLifeBarrier/></font>点伤害。<br/>持续时间：<font color='#0bff9b'>3</font>回合<br/>冷却时间：<font color='#0bff9b'>1</font>回合"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值生成一个临时<font color='#E69831'>护盾</font>，该<font color='#E69831'>护盾</font>可承受<font color='#0bff9b'><Ability:FalseLifeBarrier/></font>点伤害。<br/>持续时间：<font color='#0bff9b'>3</font>回合<br/>冷却时间：<font color='#0bff9b'>1</font>回合"
+LocFlyOverText="苌弘化碧"
+LocPromotionPopupText="<Bullet/>苌弘化碧需要一个行动点，不会结束你的回合。<br/><Bullet/>不可与其他<font color='#E69831'>护盾</font>技能叠加，取其最高者。<br/><Bullet/>持续时间：<font color='#0bff9b'>3</font>回合<br/><Bullet/>冷却时间：<font color='#0bff9b'>1</font>回合"

[MZAbyssalShot X2AbilityTemplate]
+LocFriendlyName="深渊咒枪"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值进行射击，此次攻击额外造成<font color='#0bff9b'><Ability:MZAddElemTargetDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。该攻击不受弹药的影响。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值进行射击，此次攻击额外造成<font color='#0bff9b'><Ability:MZAddElemTargetDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。该攻击不受弹药的影响。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocFlyOverText="深渊射击"
+LocPromotionPopupText="<Bullet/>至少需消耗<Ability:SelfHealthCost/>点生命值发动。<br/><Bullet/>额外造成<font color='#0bff9b'><Ability:MZAddElemTargetDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/><Bullet/>碎甲和穿甲也可获得加成。<br/><Bullet/>该攻击不受弹药的影响。<br/><Bullet/><font color='#640000'>血咒</font>：持续受到2-3的<font color='#B6B3E3'>灵能伤害</font>，灵能<font color='#ff3206'>-20</font>、意志<font color='#ff3206'>-10</font>。"

[MZAbyssalBlade X2AbilityTemplate]
+LocFriendlyName="深渊咒刃"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值进行斩击，此次攻击额外造成<font color='#0bff9b'><Ability:MZAddElemTargetDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值进行斩击，此次攻击额外造成<font color='#0bff9b'><Ability:MZAddElemTargetDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocFlyOverText="深渊咒刃"
+LocPromotionPopupText="<Bullet/>至少需消耗<Ability:SelfHealthCost/>点生命值发动。<br/><Bullet/>额外造成<font color='#0bff9b'><Ability:MZAddElemTargetDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/><Bullet/>碎甲和穿甲也可获得加成。<br/><Bullet/><font color='#640000'>血咒</font>：持续受到2-3的<font color='#B6B3E3'>灵能伤害</font>，灵能<font color='#ff3206'>-20</font>、意志<font color='#ff3206'>-10</font>。"

[MZTenebrousForm X2AbilityTemplate]
+LocFriendlyName="永暗统摄"
+LocLongDescription="深渊的阴影庇护着<Ability:Classname/>，遭受攻击时有一定概率免疫伤害。<br/>免疫伤害概率最低<font color='#0bff9b'>10%</font>，最高<font color='#0bff9b'>80%</font>。每损失<font color='#ff3206'>1%</font>生命值提高<font color='#0bff9b'>1.1%</font>概率。"
+LocHelpText="深渊的阴影庇护着<Ability:Classname/>，遭受攻击时有一定概率免疫伤害。<br/>免疫伤害概率最低<font color='#0bff9b'>10%</font>，最高<font color='#0bff9b'>80%</font>。每损失<font color='#ff3206'>1%</font>生命值提高<font color='#0bff9b'>1.1%</font>概率。"
+LocFlyOverText="永暗统摄"
+LocPromotionPopupText="<Bullet/><font color='#ff3206'>注意</font>：无法免疫范围攻击。<br/><Bullet/>免疫伤害概率最低<font color='#0bff9b'>10%</font>，最高<font color='#0bff9b'>80%</font>。<br/><Bullet/>每损失<font color='#ff3206'>1%</font>生命值提高<font color='#0bff9b'>1.1%</font>概率。"

[MZClotting X2AbilityTemplate]
+LocFriendlyName="歃血合聚"
+LocLongDescription="<Ability:Classname/>施展消耗生命值的技能将生成一个临时<font color='#E69831'>护盾</font>，该<font color='#E69831'>护盾</font>可承受<font color='#0bff9b'>2</font>点伤害。<br/>持续时间：<font color='#0bff9b'>2</font>回合"
+LocHelpText="<Ability:Classname/>施展消耗生命值的技能将生成一个临时<font color='#E69831'>护盾</font>，该<font color='#E69831'>护盾</font>可承受<font color='#0bff9b'>2</font>点伤害。<br/>持续时间：<font color='#0bff9b'>2</font>回合"
+LocFlyOverText="歃血合聚"

[MZHungeringShot X2AbilityTemplate]
+LocFriendlyName="汲血狂啖"
+LocLongDescription="<Ability:ClassName/>进行一次射击，此次攻击可恢复自身等额伤害的生命值。该攻击不受弹药的影响。<br/>使用次数：<font color='#0bff9b'>3</font>次。"
+LocHelpText="<Ability:ClassName/>进行一次射击，此次攻击可恢复自身等额伤害的生命值。该攻击不受弹药的影响。<br/>使用次数：<font color='#0bff9b'>3</font>次。"
+LocFlyOverText="汲血狂啖"
+LocPromotionPopupText="<Bullet/><font color='#ff3206'>注意</font>：需一次性消耗<font color='#ff3206'>2</font>弹药才能射击。<br/><Bullet/>每场任务最多使用<font color='#0bff9b'>3</font>次。"

[MZNightSword X2AbilityTemplate]
+LocFriendlyName="掠魂夜刃"
+LocLongDescription="<Ability:ClassName/>发动近战攻击，此次攻击可恢复自身等额伤害的生命值。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
+LocHelpText="<Ability:ClassName/>发动近战攻击，此次攻击可恢复自身等额伤害的生命值。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
+LocFlyOverText="掠魂夜刃"
+LocPromotionPopupText="<Bullet/>冷却时间：<font color='#0bff9b'>4</font>回合"

[MZAbyssalHunger X2AbilityTemplate]
+LocFriendlyName="寂庭血宴"
+LocLongDescription="使<Ability:Classname/>的吸血倍率提升为原有的<font color='#0bff9b'>150%</font>"
+LocHelpText="使<Ability:Classname/>的吸血倍率提升为原有的<font color='#0bff9b'>150%</font>"
+LocFlyOverText="寂庭血宴"

[MZDarkPotency X2AbilityTemplate]
+LocFriendlyName="煌暗伟力"
+LocLongDescription="使<Ability:ClassName/>使用消耗生命值的技能时，每消耗<Ability:MZDARKPOTENCY_HPCOST/>点生命值，则增加<font color='#0bff9b'>0.67</font>伤害，最高增加<font color='#0bff9b'>4</font>点伤害。"
+LocHelpText="使<Ability:ClassName/>使用消耗生命值的技能时，每消耗<Ability:MZDARKPOTENCY_HPCOST/>点生命值，则增加<font color='#0bff9b'>0.67</font>伤害，最高增加<font color='#0bff9b'>4</font>点伤害。"
+LocFlyOverText="煌暗伟力"
+LocPromotionPopupText="每消耗<Ability:MZDARKPOTENCY_HPCOST/>点生命值，则增加<font color='#0bff9b'>0.67</font>伤害，最高增加<font color='#0bff9b'>4</font>点伤害。"

[MZDropByDrop X2AbilityTemplate]
+LocFriendlyName="缚血腥风"
+LocLongDescription="使<Ability:Classname/>减少<font color='#0bff9b'><Ability:MZDROPBYDROP_HPCOST/></font>点消耗生命值技能所产生的损耗，减少的损耗最低不会低于<font color='#0bff9b'>2</font>点。"
+LocHelpText="使<Ability:Classname/>减少<font color='#0bff9b'><Ability:MZDROPBYDROP_HPCOST/></font>点消耗生命值技能所产生的损耗，减少的损耗最低不会低于<font color='#0bff9b'>2</font>点。"
+LocFlyOverText="缚血腥风"

[MZTenebrousReflect X2AbilityTemplate]
+LocFriendlyName="俯览昼暝"
+LocLongDescription="替换<font color='#0bff9b'>永暗统摄</font>，触发免疫伤害时将敌军<font color='#0bff9b'>100%</font>伤害进行反射并恢复自身等额生命值。<br/>每损失<font color='#ff3206'>1%</font>生命值提高<font color='#0bff9b'>1.5%</font>反射概率。"
+LocHelpText="替换<font color='#0bff9b'>永暗统摄</font>，触发免疫伤害时将敌军<font color='#0bff9b'>100%</font>伤害进行反射并恢复自身等额生命值。<br/>每损失<font color='#ff3206'>1%</font>生命值提高<font color='#0bff9b'>1.5%</font>反射概率。"
+LocFlyOverText="俯览昼暝"
+LocPromotionPopupText="<Bullet/><font color='#ff3206'>注意</font>：无法反射范围攻击。<br/><Bullet/>受到视野范围外的攻击无法对其反射。<br/><Bullet/>自身处于限制状态时也无法进行反射，如<font color='#ff3206'>燃烧</font>。"

[MZTakedownVanish X2AbilityTemplate]
+LocFriendlyName="谢幕终曲"
+LocLongDescription="使<Ability:Classname/>击杀敌军时，进入<font color='#0bff9b'>隐蔽</font>状态。"
+LocHelpText="使<Ability:Classname/>击杀敌军时，进入<font color='#0bff9b'>隐蔽</font>状态。"
+LocFlyOverText="谢幕终曲"

[MZTakedownVanishPassive X2AbilityTemplate]
+LocFriendlyName="谢幕终曲"
+LocLongDescription="使<Ability:Classname/>击杀敌军时，进入<font color='#0bff9b'>隐蔽</font>状态。"
+LocHelpText="使<Ability:Classname/>击杀敌军时，进入<font color='#0bff9b'>隐蔽</font>状态。"
+LocFlyOverText="谢幕终曲"

[MZBloodTeleport X2AbilityTemplate]
+LocFriendlyName="暗影狭间"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值进行传送，传送到小队视野范围内的任何地方。施展此技能必须处于<font color='#0bff9b'>隐蔽</font>状态。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值进行传送，传送到小队视野范围内的任何地方。施展此技能必须处于<font color='#0bff9b'>隐蔽</font>状态。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocFlyOverText="暗影狭间"
+LocPromotionPopupText="<Bullet/>目标位置必须在队伍视线内可见。<br/><Bullet/>暗影狭间需要一个行动点，不会结束<Ability:ClassName/>的回合。"

[MZBloodSpear X2AbilityTemplate]
+LocFriendlyName="神枪·冈格尼尔"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值对一条直线进行射击，此次攻击必定命中且额外造成<font color='#0bff9b'><Ability:MZAddElemMultiDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值对一条直线进行射击，此次攻击必定命中且额外造成<font color='#0bff9b'><Ability:MZAddElemMultiDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/>冷却时间：<font color='#0bff9b'>无</font>"
+LocFlyOverText="神枪·冈格尼尔"
+LocPromotionPopupText="<Bullet/>至少需消耗<Ability:SelfHealthCost/>点生命值发动。<br/><Bullet/>攻击<Ability:Classname/>视野内直线上所有敌人。<br/><Bullet/>攻击不受<font color='#3CEDD4'>掩体</font>影响，但无法造成暴击。<br/><Bullet/>额外造成<font color='#0bff9b'><Ability:MZAddElemMultiDamage/></font>武器基础伤害的<font color='#B6B3E3'>灵能伤害</font>并施加<font color='#640000'>血咒</font>。<br/><Bullet/>碎甲和穿甲也可获得加成。<br/><Bullet/><font color='#640000'>血咒</font>：持续受到2-3的<font color='#B6B3E3'>灵能伤害</font>，灵能<font color='#ff3206'>-20</font>、意志<font color='#ff3206'>-10</font>"

[MZHarvestScythe X2AbilityTemplate]
+LocFriendlyName="掠魂死镰"
+LocLongDescription="替换<font color='#0bff9b'>掠魂夜刃</font>，使其可对主目标身后的扇形区域造成伤害，对主目标外的敌军仅有<font color='#ff3206'>40%</font>恢复效果。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
+LocHelpText="替换<font color='#0bff9b'>掠魂夜刃</font>，使其可对主目标身后的扇形区域造成伤害，对主目标外的敌军仅有<font color='#ff3206'>40%</font>恢复效果。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
+LocFlyOverText="掠魂死镰"
+LocPromotionPopupText="<Bullet/>冷却时间：<font color='#0bff9b'>4</font>回合"

[MZLifeBalancer X2AbilityTemplate]
+LocFriendlyName="万相真如"
+LocLongDescription="<Ability:Classname/>与自身视野范围内的一名<font color='#0bff9b'>友军</font>或<font color='#ff3206'>敌军</font>单位平衡生命值，按照总生命值互相平分。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
+LocHelpText="<Ability:Classname/>与自身视野范围内的一名<font color='#0bff9b'>友军</font>或<font color='#ff3206'>敌军</font>单位平衡生命值，按照总生命值互相平分。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
+LocFlyOverText="万相真如"
+LocPromotionPopupText="<Bullet/>当总生命值为奇数的情况下，施法者将获得多出的部分。<br/><Bullet/>冷却时间：<font color='#0bff9b'>4</font>回合"

[GrimySoulTap X2AbilityTemplate]
+LocFriendlyName="动作如潮"
+LocHelpText="消耗<Ability:SelfHealthCost/>点生命值换取<font color='#0bff9b'>1</font>行动点。<br/>冷却时间：<font color='#0bff9b'>1</font>回合"
+LocLongDescription="消耗<Ability:SelfHealthCost/>点生命值换取<font color='#0bff9b'>1</font>行动点。<br/>冷却时间：<font color='#0bff9b'>1</font>回合"
+LocFlyOverText="动作如潮"
+LocPromotionPopupText="<Bullet/>冷却时间：<font color='#0bff9b'>1</font>回合"

[MZKillingStroke X2AbilityTemplate]
+LocFriendlyName="绝命残殇"
+LocLongDescription="<Ability:Classname/>消耗所有生命值进行斩击，此次攻击无视闪避，且根据所消耗的生命值百分比获得额外伤害、命中与暴击率，每消耗<font color='#5F0F17'>1</font>点生命值提高<font color='#0bff9b'>2.5</font>伤害，命中与暴击率最高分别为<font color='#0bff9b'>20%</font>/<font color='#0bff9b'>80%</font>。<br/>每场战斗仅限使用<font color='#0bff9b'>1</font>次"
+LocHelpText="<Ability:Classname/>消耗所有生命值进行斩击，此次攻击无视闪避，且根据所消耗的生命值百分比获得额外伤害、命中与暴击率，每消耗<font color='#5F0F17'>1</font>点生命值提高<font color='#0bff9b'>2.5</font>伤害，命中与暴击率最高分别为<font color='#0bff9b'>20%</font>/<font color='#0bff9b'>80%</font>。<br/>每场战斗仅限使用<font color='#0bff9b'>1</font>次"
+LocFlyOverText="绝命残殇"
+LocPromotionPopupText="<Bullet/>至少需消耗<Ability:SelfHealthCost/>点生命值发动。<br/><Bullet/>每场战斗仅限使用<font color='#0bff9b'>1</font>次"